const state = {
    appInfo: [
        { id: 1, title: '雷达监控', img: require('img/jiankong.png'), description: '我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介' },
        { id: 2, title: '灰名单', img: require('img/huimingdan.png'), description: '我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介' },
        { id: 3, title: '信用报告', img: require('img/baogao.png'), description: '我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介' },
        { id: 4, title: 'CRM', img: require('img/CRM.png') },
        { id: 5, title: '信用评估', img: require('img/pinggu.png'), description: '我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介我是产品简介' }
    ]
}
export default {
    state
}
